In [1]:
import pandas as pd
google_stock = pd.read_csv('GOOG.csv', index_col = ['Date'], parse_dates = True, usecols = ['Date','Adj Close'])

apple_stock = pd.read_csv('AAPL.csv', index_col = ['Date'], parse_dates = True, usecols = ['Date', 'Adj Close'])

amazon_stock = pd.read_csv('AMZN.csv', index_col = ['Date'], parse_dates = True, usecols = ['Date', 'Adj Close'])

In [2]:
google_stock.head()

            Adj Close
Date
2004-08-19  49.845802
2004-08-20  53.805050
2004-08-23  54.346527
2004-08-24  52.096165
2004-08-25  52.657513

In [3]:
dates = pd.date_range('2000-01-01', '2016-12-31')

print(type(dates))

all_stocks = pd.DataFrame(index = dates)

all_stocks.head()

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

Empty DataFrame
Columns: []
Index: [2000-01-01 00:00:00, 2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-04 00:00:00, 2000-01-05 00:00:00]

In [4]:
google_stock = google_stock.rename(columns = {'Adj Close': 'Google'})

apple_stock = apple_stock.rename( columns = {'Adj Close': 'Apple'}) 

amazon_stock = amazon_stock.rename( columns = {'Adj Close': 'Amazon'})

In [5]:
google_stock.head()

               Google
Date
2004-08-19  49.845802
2004-08-20  53.805050
2004-08-23  54.346527
2004-08-24  52.096165
2004-08-25  52.657513

In [6]:
apple_stock.head()

               Apple
Date
2000-01-03  3.596616
2000-01-04  3.293384
2000-01-05  3.341579
2000-01-06  3.052405
2000-01-07  3.196992

In [7]:
amazon_stock.head()

             Amazon
Date
2000-01-03  89.3750
2000-01-04  81.9375
2000-01-05  69.7500
2000-01-06  65.5625
2000-01-07  69.5625

In [8]:
all_stocks = all_stocks.join(google_stock)

all_stocks = all_stocks.join(apple_stock) 

all_stocks = all_stocks.join(amazon_stock)

In [9]:
all_stocks.head()

            Google     Apple   Amazon
2000-01-01     NaN       NaN      NaN
2000-01-02     NaN       NaN      NaN
2000-01-03     NaN  3.596616  89.3750
2000-01-04     NaN  3.293384  81.9375
2000-01-05     NaN  3.341579  69.7500

In [10]:
all_stocks.isnull().any()

Google    True
Apple     True
Amazon    True
dtype: bool

In [11]:
all_stocks.dropna(axis = 0,inplace=True)

In [12]:
all_stocks.isnull().any()

Google    False
Apple     False
Amazon    False
dtype: bool

In [13]:
all_stocks

                Google       Apple      Amazon
2004-08-19   49.845802    1.973460   38.630001
2004-08-20   53.805050    1.979244   39.509998
2004-08-23   54.346527    1.997236   39.450001
2004-08-24   52.096165    2.053144   39.049999
2004-08-25   52.657513    2.123831   40.299999
...                ...         ...         ...
2016-12-23  789.909973  115.088142  760.590027
2016-12-27  791.549988  115.819054  771.400024
2016-12-28  785.049988  115.325203  772.130005
2016-12-29  782.789978  115.295570  765.150024
2016-12-30  771.820007  114.396751  749.869995

[3115 rows x 3 columns]

In [14]:
print("mean for all stocks = \n\n",all_stocks.mean())
print()
print("mean for all stocks = \n\n",all_stocks.median())
print()
print("mean for all stocks = \n\n",all_stocks.std())
print()
all_stocks.corr()

mean for all stocks =

 Google    347.420229
Apple      47.736018
Amazon    216.598177
dtype: float64

mean for all stocks =

 Google    286.397247
Apple      39.461483
Amazon    161.820007
dtype: float64

mean for all stocks =

 Google    187.671596
Apple      37.421555
Amazon    199.129792
dtype: float64

          Google     Apple    Amazon
Google  1.000000  0.900242  0.952444
Apple   0.900242  1.000000  0.886321
Amazon  0.952444  0.886321  1.000000